Fix docs, migrate from blockdiag to mermaid
